{"char_to_idx": {"<PAD>": 0, "<UNK>": 1, "\t": 2, " ": 3, "!": 4, "\"": 5, "#": 6, "$": 7, "%": 8, "&": 9, "'": 10, "(": 11, ")": 12, "*": 13, "+": 14, ",": 15, "-": 16, ".": 17, "/": 18, "0": 19, "1": 20, "2": 21, "3": 22, "4": 23, "5": 24, "6": 25, "7": 26, "8": 27, "9": 28, ":": 29, ";": 30, "=": 31, ">": 32, "?": 33, "@": 34, "A": 35, "B": 36, "C": 37, "D": 38, "E": 39, "F": 40, "G": 41, "H": 42, "I": 43, "J": 44, "K": 45, "L": 46, "M": 47, "N": 48, "O": 49, "P": 50, "Q": 51, "R": 52, "S": 53, "T": 54, "U": 55, "V": 56, "W": 57, "X": 58, "Y": 59, "Z": 60, "[": 61, "\\": 62, "]": 63, "^": 64, "_": 65, "`": 66, "a": 67, "b": 68, "c": 69, "d": 70, "e": 71, "f": 72, "g": 73, "h": 74, "i": 75, "j": 76, "k": 77, "l": 78, "m": 79, "n": 80, "o": 81, "p": 82, "q": 83, "r": 84, "s": 85, "t": 86, "u": 87, "v": 88, "w": 89, "x": 90, "y": 91, "z": 92, "{": 93, "|": 94, "}": 95, "~": 96, "«": 97, "´": 98, "»": 99, "¼": 100, "½": 101, "×": 102, "ı": 103, "β": 104, "А": 105, "В": 106, "Д": 107, "Е": 108, "К": 109, "М": 110, "Н": 111, "О": 112, "П": 113, "Р": 114, "С": 115, "Т": 116, "Х": 117, "а": 118, "б": 119, "е": 120, "и": 121, "к": 122, "л": 123, "о": 124, "с": 125, "т": 126, "у": 127, "ц": 128, "я": 129, "א": 130, "ב": 131, "ד": 132, "ה": 133, "ו": 134, "י": 135, "כ": 136, "ל": 137, "ם": 138, "מ": 139, "ס": 140, "ע": 141, "ק": 142, "ר": 143, "ת": 144, "،": 145, "؛": 146, "؟": 147, "ء": 148, "ا": 149, "ب": 150, "ة": 151, "ت": 152, "ث": 153, "ج": 154, "ح": 155, "خ": 156, "د": 157, "ذ": 158, "ر": 159, "ز": 160, "س": 161, "ش": 162, "ص": 163, "ض": 164, "ط": 165, "ظ": 166, "ع": 167, "غ": 168, "ـ": 169, "ف": 170, "ق": 171, "ك": 172, "ل": 173, "م": 174, "ن": 175, "ه": 176, "و": 177, "ى": 178, "ي": 179, "٠": 180, "١": 181, "٢": 182, "٣": 183, "٤": 184, "٥": 185, "٦": 186, "٧": 187, "٨": 188, "٩": 189, "٪": 190, "٬": 191, "ٱ": 192, "پ": 193, "چ": 194, "ژ": 195, "ڤ": 196, "ک": 197, "گ": 198, "ہ": 199, "ی": 200, "ے": 201, "۲": 202, "۵": 203, "۸": 204, "​": 205, "‌": 206, "‍": 207, "‎": 208, "‏": 209, "–": 210, "—": 211, "‘": 212, "’": 213, "“": 214, "”": 215, "•": 216, "…": 217, "‫": 218, "‬": 219, "‭": 220, "‼": 221, "⁧": 222, "⁩": 223, "₪": 224, "⅔": 225, "↓": 226, "﴾": 227, "﴿": 228, "ﺴ": 229, "ﻟ": 230, "ﻤ": 231, "ﻮ": 232, "ﻻ": 233, "🏻": 234, "🏼": 235}, "diac_to_idx": {"": 0, "̀": 1, "́": 2, "̃": 3, "̄": 4, "̇": 5, "̈": 6, "̊": 7, "̧": 8, "̨": 9, "ً": 10, "ًَ": 11, "ًّ": 12, "ًٔ": 13, "ٌ": 14, "ٌّ": 15, "ٌٔ": 16, "ٌٰ": 17, "ٍ": 18, "ٍّ": 19, "ٍّٔ": 20, "ٍٔ": 21, "ٍٕ": 22, "ٍ️": 23, "َ": 24, "ََ": 25, "ََّ": 26, "ََّٔ": 27, "ََٔ": 28, "َُ": 29, "َِ": 30, "َّ": 31, "َّٓ": 32, "َّٔ": 33, "َّٕ": 34, "َٓ": 35, "َٔ": 36, "َٕ": 37, "َٰ": 38, "ُ": 39, "ُُ": 40, "ُِ": 41, "ُّ": 42, "ُّٔ": 43, "ُٓ": 44, "ُٔ": 45, "ُٕ": 46, "ِ": 47, "ِِ": 48, "ِِّ": 49, "ِِٕ": 50, "ِّ": 51, "ِّٔ": 52, "ِّٰ": 53, "ِْ": 54, "ِٓ": 55, "ِٔ": 56, "ِٕ": 57, "ِ️": 58, "ّ": 59, "ّّ": 60, "ّْ": 61, "ّٔ": 62, "ْ": 63, "ْْ": 64, "ْٓ": 65, "ْٔ": 66, "ٓ": 67, "ٔ": 68, "ٔۡ": 69, "ٕ": 70, "ٰ": 71, "ۘ": 72, "ۡ": 73, "️": 74}}